src/cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing @desserts
#+TAGS: GF(g) easy(e) fav(f)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Peanut Dipping Sauce                                                :fav:
CLOSED: [2021-05-30 Sun]
:PROPERTIES:
:export_file_name: peanut-dipping-sauce
:export_hugo_custom_front_matter: :servings 5
:export_hugo_custom_front_matter+: :prep-time 5
:export_hugo_custom_front_matter+: :cook-time 0
:export_hugo_custom_front_matter+: :ready-in 5
:export_hugo_custom_front_matter+: :source-url https://cookieandkate.com/peanut-dipping-sauce/
:END:
My family goes nuts for this peanut sauce. Pun intended. It is probably the strong driver of Asian inspired meals in my home.

*** Ingredients
- 3/4 cup creamy peanut butter
- 1/4 cup rice vinegar
- 1/3 cup reduced sodium tamari or reduced-sodium soy sauce
- 3 tablespoons honey
- 1 1/2 teaspoons grated fresh ginger or 1/2 teaspoon ground ginger
- 1 to 2 medium cloves garlic, pressed or minced, to taste
- 1/4 teaspoon red pepper flakes, plus more for sprinkling
- 2 to 4 tablespoons water or coconut milk, or as necessary to reach your desired consistency
- Optional garnishes: sprinkling of chopped roasted peanuts and additional red pepper flakes

*** Directions
1. In a 2-cup liquid measuring cup or medium-sized mixing bowl, whisk together the ingredients until well blended. If your peanut butter is particularly thick, you may need to use the full 4 tablespoons of water to thin out the mixture (or more, if necessary).
2. Feel free to adjust to taste here—for example, sometimes I want my sauce more savory and add another clove of garlic, or a little sweeter, so I add extra honey.
3. If you're serving the sauce as a party dip, transfer it to a serving bowl and sprinkle with chopped peanuts and red pepper flakes for some visual interest!

